{
  "Final Destination 1": {
    "backstory": "The story of Flight 180 began with Alex Browning's terrifying premonition of the plane's explosion. His panicked warning saved a small group of students and a teacher, but Death, feeling cheated, began to reclaim them one by one. The survivors, including Clear Rivers and Carter Horton, were stalked by a series of 'freak accidents' that were, in fact, Death correcting the timeline. From a bizarre bathroom incident to a devastating car crash, the survivors learned that the design was inescapable. Alex's attempts to intervene only seemed to alter the order, proving that Death's list is absolute.",
    "evidence_list": [
      "Retractable Clothesline Piece",
      "Shattered Light Bulb",
      "Miniature Toy Bus",
      "Charred Mug",
      "Bloody Piece of Metal",
      "Bloody Brick"
    ]
  },
  "Final Destination 2": {
    "backstory": "One year after Flight 180, Kimberly Corman had a premonition of a catastrophic pile-up on Route 23. By blocking the on-ramp, she saved a new group of survivors. They soon discovered a horrifying connection: they were all linked to the original Flight 180 survivors, having been saved from death by their actions. With the help of Clear Rivers, the last survivor of the first disaster, they sought the wisdom of William Bludworth, who explained that only 'new life' could defeat Death's design. This led to a desperate race against time, culminating in a tragic, explosive finale at a hospital.",
    "evidence_list": [
      "Toy Pigeon",
      "Nipple Ring",
      "Dirty Hair Tie",
      "Pool Ball Keychain",
      "Clove Cigarette",
      "Fuzzy Red Dice",
      "Photo of Officer Burke",
      "Photo of Kimberly Corman",
      "Work Gloves",
      "White Rose",
      "Newspaper Clipping about Flight 180"
    ]
  },
  "Final Destination 3": {
    "backstory": "At an amusement park, Wendy Christensen's premonition of the Devil's Flight roller coaster crash saved her and several classmates. Using her camera and photographs that seemed to predict each death, Wendy and Kevin Fischer desperately tried to save the survivors. They discovered that the photos contained clues about how Death would claim each victim. Despite their best efforts to intervene, Death's design proved relentless, leading to increasingly elaborate and brutal deaths. The franchise's exploration of fate versus free will reached new depths as the survivors learned that every attempt to cheat death only delayed the inevitable.",
    "evidence_list": [
      "Camera",
      "Navel Piercing with Crystal",
      "Photo of Jason on Devil's Flight",
      "Photo of the Ashleys",
      "Mud Flap Girl Necklace",
      "Photo of Lewis from Ring-The-Bell Game",
      "Photo of Ian with Banners",
      "Strip of Nails",
      "Overexposed Photo of Kevin",
      "Photo of Julie Giving the Finger",
      "Photo of Perry",
      "Photo of Amber"
    ]
  },
  "The Final Destination": {
    "backstory": "At the McKinley Speedway, Nick O'Bannon's premonition of a catastrophic race car crash saved a small group of spectators. The survivors initially dismissed the supernatural explanation, but as 'accidents' began claiming them, they were forced to confront the truth. This installment pushed the franchise's gore to new extremes, featuring some of the most elaborate death sequences yet seen. The survivors learned that Death's design could span across seemingly unrelated incidents, and their attempts to break the chain only resulted in more creative and brutal eliminations. The movie's exploration of technology and surveillance added a modern twist to the classic formula.",
    "evidence_list": [
      "(Un)Lucky Coin",
      "Can of Hice Pale Ale",
      "Horseshoe Ornament",
      "Safety Goggles",
      "Hair Clip",
      "Movie Ticket Stub",
      "Confederate Flag Patch",
      "Binocular Flask",
      "Cowboy Hat",
      "Security Guard Flashlight",
      "Bloody Arm Cast",
      "Woman's Shoe"
    ]
  },
  "Final Destination 5": {
    "backstory": "During a company retreat, Sam Lawton's premonition of the North Bay Bridge collapse saved his coworkers from a horrific fate. As Death began claiming the survivors, they discovered a new 'rule': they could transfer their remaining lifespan by killing someone else. This revelation created moral dilemmas and paranoia among the group, as some considered murder to save themselves. The franchise's darkest themes emerged as friends turned against each other, and the line between victim and perpetrator blurred. In a shocking twist, the survivors' escape route led them directly to Flight 180, revealing the franchise's interconnected nature.",
    "evidence_list": [
      "Pair of Glasses",
      "Rubber Band",
      "Accupuncture Needle",
      "Metal Spike",
      "Chef's Knife",
      "Airplane Ticket (Paris)",
      "Damaged Police Badge",
      "Bent Meat Skewer"
    ]
  },
  "Final Destination 6: Bloodlines": {
    "backstory": "Set in 1968, the prequel revealed the origins of Death's design through a family bloodline. When Evie Bludworth's premonition of the Skyview Restaurant explosion saved several patrons, it set in motion a generational curse. As Iris Campbell documented the supernatural pattern, she discovered that Death's influence could span decades and affect entire family lines. The survivors and their descendants became entangled in an elaborate web of fate, with each generation paying for the survival of the previous. The film explored how trauma and supernatural curses can echo through time, affecting children and grandchildren of the original survivors.",
    "evidence_list": [
      "Charred Vintage Earrings",
      "Bent Elevator Call Button",
      "Scuffed Dress Shoe",
      "Broken Ivory Piano Key",
      "Gammy's Death Book",
      "Bloodied Lawn Mower Spark Plug",
      "Torn Sanitation Worker Vest Fragment",
      "Septum Ring",
      "Candy Wrapper",
      "Cracked RV Side Mirror",
      "Splintered Log Piece (Stefani)",
      "Damaged Prom Corsage"
    ]
  },
  "Book: Dead Reckoning": {
    "backstory": "The chronicle Dead Reckoning follows Jess Golden, a nineteen-year-old musician and petty thief whose life is thrown into chaos after she experiences a horrifyingly vivid premonition of Club Kitty collapsing during her band's performance. Her frantic warning manages to save a small group of people, including her bandmate Jamie, two jocks named Eric and Ben, a waitress named Macy, the club's bouncer Sebastian, an off-duty cop named Marina Hewlett, and a popular student, Charlie Delgado with his date, Amber. Though they escape the initial catastrophe, Jess's relief is short-lived.\n\nThe survivors soon find themselves stalked by Death, picked off one by one in a series of bizarre and gruesome accidents. Haunted by her vision and aided by a cryptic homeless man who speaks of 'signs,' Jess realizes the survivors are dying in the order they were meant to in the club collapse. What follows is a desperate race against time as Jess, Jamie, and a reluctant Eric try to decipher the omens and intervene in Death's new design, all while being pursued by police who suspect Jess's foreknowledge is something more sinister. The narrative is a classic study in the futility of fighting a pre-ordained fate, where every attempt to save a life only seems to complicate the next, inevitable demise.",
    "evidence_list": [
      "Drumstick",
      "Flask",
      "Macy's Name Tag",
      "Officer Hewlett's Badge",
      "Car Keys",
      "Compact",
      "Surfboard Fin",
      "Cigarette Lighter"
    ]
  },
  "Book: Destination Zero": {
    "backstory": "In Destination Zero, a group of strangers narrowly escapes a deadly bombing on the Los Angeles Metro thanks to a premonition by Patti Fuller. Patti’s vision of the explosion at South Hill Street station allows her to prevent her boyfriend Will Sax, demolition driver Hal Ward, construction boss Zack Halloran, auto-yard owner Susan Fries, and talent agent Al Kinsey from boarding the doomed train. Soon after, Death begins to reclaim the survivors.\n\nHal Ward is the first to die, drowning in a desert flash flood after crashing his dirt bike and becoming trapped by tree roots. Next, Zack Halloran is sliced in half vertically by a sheet of glass that falls from a construction site. Susan Fries dies when a spark of static electricity ignites a pail of aluminum powder she is carrying, creating a thermite reaction that burns through her chest. Al Kinsey is then decapitated by a flying hubcap during a street race. Finally, Will Sax is killed when multiple CD and DVD players in the electronics store where he works begin firing discs like projectiles, cutting him to pieces. After discovering a similar pattern of events from the past, including one involving her own ancestor in 1888, the last survivor, Patti, decides to cheat the design. She forces a veterinarian to administer a fatal injection, having already called paramedics to the scene. She is successfully resuscitated, breaking the chain and ending Death's pursuit.",
    "evidence_list": [
      "Locket",
      "Bill Sangster's Knife",
      "Scalpel",
      "Cobra Totem",
      "Brooch",
      "Magnifying Glass",
      "Ink Pen",
      "Press Pass",
      "Circuit City Name Tag",
      "Business Card",
      "Wrench",
      "Construction Pin",
      "Demolition Derby Ticket Stub"
    ]
  },
  "Book: End of the Line": {
    "backstory": "End of the Line follows a group of international students on a cultural exchange trip in New York City. One of the students, Danny King, has a vivid premonition of a catastrophic subway derailment and collision while on a ghost train ride at Coney Island. When details from his vision begin to manifest in reality on the subway the next day, he panics and forces his twin sister Louise, fellow students Peter Hoffman, James Barker, Bodil Raden, their chaperone Mary-Beth, and an old man named Jack Cohen off the train just moments before it crashes.\n\nSoon after, the survivors begin to die in a series of bizarre and elaborate accidents. Danny teams up with Kate Shelley, a medical student who is having her own death-related visions, to uncover the pattern. They discover that Death is picking off the survivors one by one, and that Kate, who had a near-death experience a week prior, has become an unwitting agent of Death, unknowingly setting up the very accidents that kill the others . In a final, desperate attempt to end the cycle, Kate takes her own life.",
    "evidence_list": [
      "Bicycle Brake Handle",
      "Hairpin",
      "Broken Train Handhold",
      "Turquoise Charm",
      "Skeleton Figurine",
      "Tattered Book",
      "Floral Hair Decoration",
      "Used syringe",
      "Patient Wristband",
      "Corkscrew"
    ]
  },
  "Book: Dead Man's Hand": {
    "backstory": "The story begins in Las Vegas, where a group of strangers survives a catastrophic elevator collapse at the Merlin's Tower hotel casino. The visionary, Allie Goodwin, has a premonition of the elevator car detaching from the building and plummeting over a hundred stories, killing everyone inside. Her ensuing panic convinces her new husband Tom Gaines, a cynical gambler Arlen Ploog, a showgirl Shawna Engels, and off-duty detective Warren Ackerman to get off the elevator just moments before the cables snap and it crashes.\n\nConvinced they are now on Death's list, the survivors are stalked by a series of increasingly elaborate and improbable 'accidents'. Their attempts to understand the pattern are complicated by an FBI investigation that considers Allie a prime suspect in a terrorist plot.\nOne by one, the survivors are claimed in gruesome fashion, from a runaway car in a casino to an alleyway electrocution. In the end, Allie, the sole survivor, learns she was infected with HIV from a deceased police officer's blood during one of the chaotic events, leaving her with an inescapable and lingering death sentence as the design corrects itself.",
    "evidence_list": [
      "iPod",
      "Female Wedding Band",
      "Male Wedding Band",
      "Poker Chip",
      "Costume Feather",
      "Detective Badge",
      "Detective Notepad"
    ]
  },
  "Book: Looks Could Kill": {
    "backstory": "The chronicle Looks Could Kill centers on Sherry Pulaski, a nineteen-year-old supermodel who experiences a powerful premonition of a cruise ship disaster during a celebratory party in Miami harbor. Her frantic warning convinces a small group of fellow models—Brut, Shiraz, Chablis, Chardonnay, Rose, her best friend Cabernet, and Cabernet's boyfriend, the photographer Gunter—to disembark just moments before the ship is struck by a speedboat and explodes, killing everyone aboard, including their agent, Merlot.\n\nIn the aftermath, Sherry is horribly disfigured by flaming debris from the explosion . While she recovers, her \"friends\" abandon her and the survivors begin to die in a series of bizarre accidents. Sherry is visited by a mysterious, gray-eyed man who reveals himself to be Death . He explains that she has disrupted his design and offers her a deal: help him reclaim the lives of the six other survivors, and with each death, a portion of her original beauty will be restored . Cold and embittered, Sherry agrees, becoming a \"Judas goat\" who leads her former friends to their meticulously orchestrated doom.",
    "evidence_list": [
      "Sherry's Cellphone",
      "Camera Lens Cap",
      "Small Mirror",
      "Compact Mirror",
      "'Chardonnay''s Lighter",
      "'Shiraz' Edelstein's Braid",
      "'Chablis''s Cat Toy"
    ]
  },
  "Book: Death of the Senses": {
    "backstory": "The chronicle Death of the Senses follows Jack Curtis, a homeless man haunted by a past tragedy, whose life is irrevocably altered when he experiences a violent premonition. This vision allows him to save NYPD officer Amy Tom from being murdered by a deranged serial killer in a dark alley. After Jack kills the attacker in self-defense, they discover the killer’s journal, which reveals he was planning to murder five prominent New Yorkers, each representing one of the five senses, as a twisted act of \"purification\".\n\nThough the killer is dead, his intended victims begin to die in a series of bizarre and increasingly elaborate \"accidents\". Jack and a reluctant Amy Tom forge an alliance, racing to identify the remaining targets from the journal's cryptic clues and warn them before their time runs out. Their efforts are complicated by Amy's overprotective partner, Pete Beriev, who suspects Jack is the true culprit behind the deaths. The narrative climaxes with the revelation that Jack himself was the secret sixth victim, representing the \"sixth sense,\" and his survival causes the death list to reset, targeting the survivors anew in a final, tragic chain reaction.",
    "evidence_list": [
      "Small Football Trophy",
      "Metal Sculpture Piece",
      "Earbud",
      "Small Microphone",
      "Wine Bottle Stopper",
      "Miniature Garbage Truck",
      "Eyedrops"
    ]
  },
  "Comic: Sacrifice": {
    "backstory": "This dark tale follows a man tormented by premonitions. After his vision of a bus crash fails to save his best friend, he successfully saves a group of factory workers from an explosion. However, his 'gift' makes him a pariah. The survivors he saved are picked off one by one, and he becomes the prime suspect. Haunted by a final vision of his family dying in a gas station fire, he makes the ultimate choice, believing that sacrificing himself is the only way to break the cycle and save them.",
    "evidence_list": [
      "Suicide Note",
      "Picket Fence Splinter",
      "Rubber Ducky",
      "Lawnmower Blade Piece",
      "Train Ticket"
    ]
  },
  "Comic: Spring Break": {
    "backstory": "A college spring break trip turned deadly when Carly Hagan's premonition of a hotel fire and explosion saved her friends. As Death hunted them across the party destinations of Mexico, Carly struggled to convince her skeptical friends of the supernatural threat. The comic explored themes of youth, recklessness, and the collision between carefree vacation mentality and mortal terror. Each death was tied to the hedonistic activities that defined spring break culture, as Death turned pleasure into pain. Despite Carly's desperate efforts to save everyone, she ultimately vanished mysteriously, leaving questions about whether she escaped or became Death's final victim.",
    "evidence_list": [
      "Carly Hagan's Notebook",
      "Spanish Phrasebook",
      "Sunglasses",
      "Fireworks Wrapper",
      "Swimsuit Piece",
      "Bridge Piece",
      "Dreena's Necklace",
      "Glass Shard",
      "Display Skeleton Piece",
      "Propeller Blade"
    ]
  },
  "Book: Wipeout (Unreleased)": {
    "backstory": "At a Hawaiian beach paradise, a plane crash premonition saved a group of tourists and locals from certain death. As Death pursued them across the tropical islands, it used the very beauty of paradise against its victims—from volcanic glass beaches causing unusual wounds to rip currents pulling swimmers into jagged lava tubes. But an even more direct threat emerged in the form of Corbin Wainright, a secretive ex-military survivor. Haunted by a debt he believed he owed Death for being spared in combat, Wainright began hunting the others, convinced that by 'collecting' them, he could settle his own account. This grim pursuit, set against a backdrop of volcanic eruptions and freak tidal waves, culminated in a violent confrontation that left Wainright the only survivor. Once returning to the mainland, Wainright lived his life until he was critically injured when a single engine passenger plane crashed beside him while he was stopped in traffic, silencing the hunter and ironically placing him on a ventilator in Hope River Hospital, where his own fate would be decided by another.",
    "evidence_list": [
      "Surf Wax (Black)",
      "Seashell Necklace Fragment",
      "Rusty Fishing Hook",
      "Tacky Souvenir T-Shirt",
      "Ukulele String",
      "Skateboard Wheel",
      "Temporary Tattoo Sheet",
      "Crushed Beer Can",
      "Military Dog Tag"
    ]
  },
  "William Bludworth Archives": {
    "backstory": "William Bludworth, the enigmatic coroner who appears throughout the franchise, has documented decades of supernatural deaths. His personal archives contain evidence from numerous incidents where Death's design was interrupted or altered. Bludworth's research suggests that he may be more than just an observer - possibly an agent of Death itself, or someone who has achieved immortality through understanding. His notes reveal patterns and connections between disasters spanning generations, indicating that Death's design is far more complex and long-term than previously understood. These archives represent the accumulated wisdom of someone who has witnessed Death's work firsthand and lived to tell about it.",
    "evidence_list": [
      "Newspaper Clipping",
      "Morgue Log Excerpt",
      "Bludworth's Note",
      "Bludworth's Final Notes",
      "hospital_directory_pamphlet"
    ]
  }
}